{"Atajo de teclado o comandos": ["x", "3x", "X", "r", "s", "dw", "cw", "diw", "ciw", "c$", "cc", "d6w", "d6b", "c3w", "dd", "shift + d", "d0", "cc", "shift + c", "c0", "2dd", "2cc", "Ctrl+h", "Ctrl+w", "Ctrl+u", "xp", ":%d", "dgg", "dG", ":[2],[4]", ":1,.-1d", ":.+1,$d", ":g/<patrón>/d", ":g!/<patrón>/d", ":g/^A/d", ":g/^$/d", ":.-2,.+8d"], "Función": ["Para eliminar un carácter en modo normal.", "Elimina 3 caracteres a partir de donde tenemos posicionado el cursor.", "Borrar tan solo un carácter a la izquierda del cursor.", "Reemplazar una carácter.", "Eliminar un carácter y cambiar a modo insertar.", "Borrar la palabra desde donde tengamos el cursor hasta el final de la palabra.", "Borrar la palabra desde donde tengamos el cursor hasta el final de la palabra y cambiar a modo insertar.", "Borrar la palabra entera sobre la que se encuentra el cursor.", "Borrar la palabra entera sobre la que se encuentra el cursor y cambiar a modo insertar.", "Borrar todo el texto hasta el final de línea y pasar a modo insertar.", " o ", "Eliminar 6 palabras a partir de donde tengamos posicionado el cursor.", "Eliminar 6 palabras anteriores a donde tenemos posicionado el cursor.", "Eliminar 3 palabras a partir de donde tengamos posicionado el cursor y cambiar a modo insertar.", "Para borrar/cortar una línea entera.", "Borrar desde la posición del cursor hasta el final de la línea.", "Borrar desde la posición del cursor hasta el inicio de la línea.", "Para borrar/cortar toda un línea entera y cambiar a modo insertar.", "Borrar desde la posición del cursor hasta el final de la línea y cambiar al modo insertar.", "Borrar desde la posición del cursor hasta el inicio de la línea y cambiar al modo insertar.", "Borrar/cortar 2 líneas de golpe a partir de donde tenemos posicionado el cursor.", "Borrar/cortar 2 líneas de golpe a partir de donde tenemos posicionado el cursor y cambiar al modo insertar.", "Estando en modo inserción elimina el carácter que está antes del cursor.", "Estando en modo inserción elimina toda la palabra que hay justo detrás del cursor.", "Estando en modo inserción elimina toda la línea que hay detrás del cursor.", "Transponer 2 letras.", "Para borrar todas las líneas de un fichero.", "Borrar desde la posición actual del cursor hasta al principio del fichero.", "Borrar desde la posición actual del cursor hasta al final del fichero.", "Para eliminar las líneas de la 2 a la 4 podemos usar la formula ", "Eliminar todas las líneas antes de la línea actual.", "Eliminar todas las líneas después de la línea actual.", "Eliminar todas las filas que contengan un determinado patrón o palabra. Para eliminar todas las filas que contengan la palabra importante usaremos el comando ", "Borrar todas las líneas que no contengan una determinada palabra o patrón. Por ejemplo ", "Eliminar todas las líneas que empiezan por la letra ", "Para eliminar todas las líneas vacías de un documento.", "Eliminar líneas desde 2 líneas encima de mi posición hasta 8 líneas debajo de mi posición."]}